In [1]:
import inspect
import re
from contextlib import contextmanager
from warnings import catch_warnings, filterwarnings, warn

from pandas.io.sql import read_sql, to_sql
from sqlalchemy import create_engine
from sqlalchemy.event import listen
from sqlalchemy.exc import DatabaseError, ResourceClosedError
from sqlalchemy.pool import NullPool

In [2]:
URI = "mysql://root:password@localhost/"

In [3]:
engine = create_engine(URI, poolclass=NullPool)

In [4]:
engine

Engine(mysql://root:***@localhost/)

In [5]:
engine.name

'mysql'

In [6]:
LOADED_TABLES = set()

In [7]:
_conn = engine.connect()

In [8]:
_conn

In [9]:
# so at this point it does this, and I dont know what this does
# doesnt the doc say this is always searched first?
if engine.name == "postgresql":
    _conn.execute("set search_path to pg_temp")
# https://www.postgresql.org/docs/current/ddl-schemas.html#DDL-SCHEMAS-PATH
# https://www.postgresql.org/docs/current/runtime-config-client.html
# # search_path
# This variable specifies the order in which schemas are searched when an object (table, data type, function, etc.) is referenced by a simple name with no schema specified. When there are objects of identical names in different schemas, the one found first in the search path is used. An object that is not in any of the schemas in the search path can only be referenced by specifying its containing schema with a qualified (dotted) name.
# Likewise, the current session's temporary-table schema, pg_temp_nnn, is always searched if it exists. It can be explicitly listed in the path by using the alias pg_temp. If it is not listed in the path then it is searched first (even before pg_catalog). However, the temporary schema is only searched for relation (table, view, sequence, etc) and data type names. It is never searched for function or operator names.

In [10]:
from mypandas.sqldf import extract_table_names

In [11]:
QUERY = """
SELECT *
FROM apple, banana;
"""
extract_table_names(QUERY)

QUALNAME extract_table_names
OUTPUT {'apple', 'banana'}

{'apple', 'banana'}

In [12]:
from mypandas.sqldf import MyPandas

URI = "mysql://root:password@localhost/"
mypd = MyPandas(URI)
def query_mypd(query):
    return mypd(query, globals())

QUALNAME PandaSQL.__init__
OUTPUT None

In [13]:
with mypd.conn as c:
    print(c)
    print((c.execute("SELECT DATABASE();").fetchone()))

QUALNAME PandaSQL._init_connection
Initing conn
Before (None,)
After ('__mypandas_temp',)
OUTPUT None
<sqlalchemy.engine.base.Connection object at 0x11a5fa320>
('__mypandas_temp',)
Closing conn

In [14]:
from mypandas import load_births
births = load_births()

In [15]:
births

          date  births
0   1975-01-01  265775
1   1975-02-01  241045
2   1975-03-01  268849
3   1975-04-01  247455
4   1975-05-01  254545
..         ...     ...
403 2012-08-01  359554
404 2012-09-01  361922
405 2012-10-01  347625
406 2012-11-01  320195
407 2012-12-01  340995

[408 rows x 2 columns]

In [16]:
mypd('select * from births limit 5;', locals())

QUALNAME PandaSQL.__call__
QUALNAME PandaSQL._init_connection
Initing conn
Before (None,)
After ('__mypandas_temp',)
OUTPUT None
QUALNAME extract_table_names
OUTPUT {'births'}
QUALNAME write_table
OUTPUT None
Closing conn
OUTPUT         date  births
0 1975-01-01  265775
1 1975-02-01  241045
2 1975-03-01  268849
3 1975-04-01  247455
4 1975-05-01  254545

        date  births
0 1975-01-01  265775
1 1975-02-01  241045
2 1975-03-01  268849
3 1975-04-01  247455
4 1975-05-01  254545

In [17]:
import pandas as pd
df = pd.DataFrame({'date': ['1975-01-01'], 'foo': ['bar']})

In [18]:
df

         date  foo
0  1975-01-01  bar

In [19]:
mypd('select * from df;', locals())

QUALNAME PandaSQL.__call__
QUALNAME PandaSQL._init_connection
Initing conn
Before (None,)
After ('__mypandas_temp',)
OUTPUT None
QUALNAME extract_table_names
OUTPUT {'df'}
QUALNAME write_table
OUTPUT None
Closing conn
OUTPUT          date  foo
0  1975-01-01  bar

         date  foo
0  1975-01-01  bar

In [20]:
mypd('select * from births limit 5;', locals())

QUALNAME PandaSQL.__call__
QUALNAME PandaSQL._init_connection
Initing conn
Before (None,)
After ('__mypandas_temp',)
OUTPUT None
QUALNAME extract_table_names
OUTPUT {'births'}
QUALNAME write_table
OUTPUT None
Closing conn
OUTPUT         date  births
0 1975-01-01  265775
1 1975-02-01  241045
2 1975-03-01  268849
3 1975-04-01  247455
4 1975-05-01  254545

        date  births
0 1975-01-01  265775
1 1975-02-01  241045
2 1975-03-01  268849
3 1975-04-01  247455
4 1975-05-01  254545

In [21]:
mypd('select * from births join df on births.date = df.date;', locals())

QUALNAME PandaSQL.__call__
QUALNAME PandaSQL._init_connection
Initing conn
Before (None,)
After ('__mypandas_temp',)
OUTPUT None
QUALNAME extract_table_names
OUTPUT {'df', 'births'}
QUALNAME write_table
OUTPUT None
QUALNAME write_table
OUTPUT None
Closing conn
OUTPUT         date  births        date  foo
0 1975-01-01  265775  1975-01-01  bar

        date  births        date  foo
0 1975-01-01  265775  1975-01-01  bar

In [22]:
mypd('select * from births b1, births b2;', locals())

QUALNAME PandaSQL.__call__
QUALNAME PandaSQL._init_connection
Initing conn
Before (None,)
After ('__mypandas_temp',)
OUTPUT None
QUALNAME extract_table_names
OUTPUT {'births'}
QUALNAME write_table
OUTPUT None
Closing conn
OUTPUT              date  births       date  births
0      2012-12-01  340995 1975-01-01  265775
1      2012-11-01  320195 1975-01-01  265775
2      2012-10-01  347625 1975-01-01  265775
3      2012-09-01  361922 1975-01-01  265775
4      2012-08-01  359554 1975-01-01  265775
...           ...     ...        ...     ...
166459 1975-05-01  254545 2012-12-01  340995
166460 1975-04-01  247455 2012-12-01  340995
166461 1975-03-01  268849 2012-12-01  340995
166462 1975-02-01  241045 2012-12-01  340995
166463 1975-01-01  265775 2012-12-01  340995

[166464 rows x 4 columns]

             date  births       date  births
0      2012-12-01  340995 1975-01-01  265775
1      2012-11-01  320195 1975-01-01  265775
2      2012-10-01  347625 1975-01-01  265775
3      2012-09-01  361922 1975-01-01  265775
4      2012-08-01  359554 1975-01-01  265775
...           ...     ...        ...     ...
166459 1975-05-01  254545 2012-12-01  340995
166460 1975-04-01  247455 2012-12-01  340995
166461 1975-03-01  268849 2012-12-01  340995
166462 1975-02-01  241045 2012-12-01  340995
166463 1975-01-01  265775 2012-12-01  340995

[166464 rows x 4 columns]

In [23]:
query_mypd("""
with cte as (
select b1.date d1, b1.births b1, b2.date d2, b2.births b2
from births b1, births b2
)
select * from cte;
""")

QUALNAME PandaSQL.__call__
QUALNAME PandaSQL._init_connection
Initing conn
Before (None,)
After ('__mypandas_temp',)
OUTPUT None
QUALNAME extract_table_names
OUTPUT {'cte', 'births'}
QUALNAME write_table
OUTPUT None
Closing conn
OUTPUT                d1      b1         d2      b2
0      2012-12-01  340995 1975-01-01  265775
1      2012-11-01  320195 1975-01-01  265775
2      2012-10-01  347625 1975-01-01  265775
3      2012-09-01  361922 1975-01-01  265775
4      2012-08-01  359554 1975-01-01  265775
...           ...     ...        ...     ...
166459 1975-05-01  254545 2012-12-01  340995
166460 1975-04-01  247455 2012-12-01  340995
166461 1975-03-01  268849 2012-12-01  340995
166462 1975-02-01  241045 2012-12-01  340995
166463 1975-01-01  265775 2012-12-01  340995

[166464 rows x 4 columns]

               d1      b1         d2      b2
0      2012-12-01  340995 1975-01-01  265775
1      2012-11-01  320195 1975-01-01  265775
2      2012-10-01  347625 1975-01-01  265775
3      2012-09-01  361922 1975-01-01  265775
4      2012-08-01  359554 1975-01-01  265775
...           ...     ...        ...     ...
166459 1975-05-01  254545 2012-12-01  340995
166460 1975-04-01  247455 2012-12-01  340995
166461 1975-03-01  268849 2012-12-01  340995
166462 1975-02-01  241045 2012-12-01  340995
166463 1975-01-01  265775 2012-12-01  340995

[166464 rows x 4 columns]